Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_2.tmx
Source language: de
Languages: en

source: Kühlerverschlusskappen für Motorenkühler
en: Radiator caps for cooling radiators of engines

source: Seilrollen mit Schrauben [Maschinen]
en: Screw pulley blocks [machines]

source: Düsensprüher [Maschinenteil]
en: Screw sprayers being machines

source: Dichtungsverbindungen [Maschinenteile]
en: Sealing joints [parts of machines]

source: Landwirtschaftliche Kultivierungsmaschinen
en: Agricultural machines for cultivating

source: Landwirtschaftliche Maschinen zum Graseinbringen
en: Agricultural machines for grass collecting

source: Landwirtschaftliche Pflugmaschinen
en: Agricultural machines for ploughing

source: Elektrische Schneebesen für den Haushalt
en: Whisks, electric, for household purposes

source: Kompressoren
en: Compressors

source: Räumgeräte [Maschinen] zum Entfernen von Schlamm
en: Scraper apparatus [machines] for removing sludge

source: Ölfilter [Maschinenteile]
en: Oil filters [machine parts]

source: Straßenkehrvorrichtungen für Fahrzeuge
en: Road sweeping attachments for vehicles

source: Maschinelle Bohrwerkzeuge mit Gleitschienen
en: Boring tools (Machine -) with slides

source: Mühlsteine [Maschinenteile]
en: Millstones [machine parts]

source: Straßenreinigungsfahrzeuge [Maschinen]
en: Street cleaning vehicles [machines]

source: Streckfolienverpackungsmaschinen zum Umhüllen von palettisierten Lasten mit Klebefolie
en: Stretch-wrapping machines for applying cling film to palletised loads

source: Filzrollen als Maschinenteile zur Verwendung bei Polierarbeiten
en: Non-woven rollers being parts of machines for use in polishing

source: Maschinen zum Befüllen von Behältern
en: Machines for filling containers

source: Bauteile für Pumpstationen
en: Pumping station assemblies

source: Verzahnungseinsätze [Maschinenteile]
en: Spline shank bits [parts of machines]

source: Maschinen zum Bedrucken von Etiketten
en: Printing machines for printing on labels

source: Hydraulische Prozesssteuerungsgeräte
en: Process control units [hydraulic]

source: Maschinen zur Befüllung von Pralinen mit Schokolade
en: Machines for applying chocolate to the centres of chocolates

source: Walzenwaschmaschinen zum Waschen von Druckwalzen
en: Roller washing machines for washing print rollers

source: Ablassschrauben für Hydraulikflüssigkeiten [Maschinenteile]
en: Discharge screws for hydraulic fluids [parts of machines]

source: Erzabscheider [Maschinen]
en: Ore separators [machines]

source: Druckstrahlreinigungsmaschinen für gewerbliche Zwecke
en: Industrial cleaning machines utilising pressure jets

source: Gewerbliche Bodenreinigungsmaschinen
en: Industrial floor cleaning machines

source: Anbauteile für Bulldozer
en: Attachments for bulldozers

source: Anbauteile für Kräne
en: Attachments for cranes

source: Sprühköpfe [Maschinenteile]
en: Spray heads [parts of machines]

source: Sprühlanzen für den Anschluss an Druckwaschmaschinen für Reinigungszwecke
en: Spray lances for attachment to pressure washing machines for cleaning purposes

source: Fahrbare Gepäckförderbänder
en: Mobile baggage conveyors

source: Drehhämmer [Maschinen]
en: Rotary hammers [machines]

source: Rotierende Papierschneidmaschinen, ausgenommen für Bürozwecke
en: Rotary paper trimming machines, other than for office use

source: Gasgeneratoren [Kompressoren] zum Heben unter Wasser
en: Gas generators [compressors] for undersea lifting

source: Industrielle Druckmaschinen
en: Industrial printing machines

source: Schäler [elektrische Maschinen]
en: Peelers [electric machines]

source: Granuliermesser als Maschinenteile
en: Pelletizer blades being parts of machines

source: Farbentfernungsgeräte [Maschinen]
en: Paint stripping apparatus [machines]

source: Schalldämpfer als Teile von Auspuffanlagen von Maschinen
en: Sound absorbers [silencers] being parts of exhaust systems for machines

source: Zündkerzen für Motoren von Landfahrzeugen
en: Spark plugs for land vehicle engines

source: Kalanderwalzen [Maschinen]
en: Calender rollers [machines]

source: Nockenwellen für Maschinen
en: Camshafts for machines

source: Sägezahnsetzmaschinen für die Holzbearbeitung
en: Woodworking saw-tooth setting machines

source: Zerkleinerungsmaschinen für gewerbliche Zwecke
en: Shredders [machines] for industrial use

source: Schieber [Maschinenteile]
en: Valves [parts of machines]

source: Maschinen zum Heben von Fahrzeugen
en: Machines for lifting vehicles

source: Kupplungen und Riemen zur Kraftübertragung, ausgenommen für Landfahrzeuge und deren Teile
en: Machine coupling and transmission components, except for land vehicles, and parts therefor

source: Reduktionsgetriebe [Maschinenteile]
en: Pressure reducers [parts of machines]

source: Tragbare Filtergeräte [Maschinen]
en: Portable filtration units [machines]

source: Verbindungselemente [Maschinenteile]
en: Linking devices [parts of machines]

source: Ladegeräte [Maschinen]
en: Loaders [machines]

source: Treibstoffpumpen für Kraftfahrzeuge
en: Fuel pumps for motor vehicles

source: Luftpumpen als Garageneinrichtung
en: Air pumps [garage installations]

source: Pumpen für Heizungsanlagen
en: Pumps for heating installations

source: Häckslermesser [Maschinenteile]
en: Chaff cutter blades [parts of machines]

source: Kettenschutz [Maschinenteile]
en: Chainguards [parts of machines]

source: Schneideinsätze für Werkzeugmaschinen
en: Cutting inserts for machine tools

source: Zerkleinerer [Maschinen] für Karton
en: Shredders [machines] for cardboard

source: Krümmer [Teile von Motoren]
en: Manifolds [parts of engines]

source: Stellantriebe für Triebwerke
en: Actuators for mechanisms

source: Pumpen zum Kühlen von Motoren
en: Pumps for cooling engines

source: Gesteinsbohreinsätze für Bohrmaschinen
en: Rock bits for drilling machines

source: Gesteinsbohrer [Maschinen]
en: Rock drills [machines]

source: Maschendrahtschneider [Maschinen]
en: Wiremesh cutters [machines]

source: Zuführvorrichtungen für Zerkleinerungsmaschinen
en: Feeding units for size reduction machines

source: Keramik- und Metallfräsmaschinen
en: Textile tentering machines

source: Mit Jetons betätigte Verkaufsautomaten
en: Vending machines (Counter operated -)

source: Vertikutierer [Erdbewegungsmaschinen]
en: Scarifiers [earth moving machines]

source: Vertikale Turbinenpumpen
en: Vertical turbine pumps

source: Servomotoren mit Kodiergeräten
en: Servomotors incorporating encoders

source: Rührwerke zum Umwälzen flüssiger Medien
en: Agitators for circulating liquid media

source: Luftfilter für maschinelle Geräte
en: Air filters for mechanical purposes

source: Kohlebürsten [Elektrizität]
en: Carbon brushes [electricity]

source: Zigarettenmaschinen für gewerbliche Zwecke
en: Cigarette machines for industrial purposes

source: Kolben für Maschinen
en: Pistons for machines

source: Metallschneideanlagen [Maschinen]
en: Metal cutting centres [machines]

source: Federbetriebene Spulen
en: Spring driven reels

source: Zahnräder für Maschinen
en: Gear wheels for machines

source: Gehäuse für Industriemaschinen
en: Casings for industrial machines

source: Rauchschieber [Maschinenteile]
en: Dampers [parts of machines]

source: Stoßdämpferkolben [Teile von Triebwerken oder Motoren]
en: Dashpot plungers [parts of engines or motors]

source: Dekanterzentrifugen mit integrierter Förderschnecke
en: Decanter centrifuges incorporating screw conveyors

source: Saugmaschinen für gewerbliche Zwecke
en: Suction machines for industrial purposes

source: Kesselsteinsammler für Maschinenkessel
en: Scale collectors for machine boilers

source: Bürsten als Teile von Dynamos
en: Brushes being parts of dynamos

source: Siebe für die Papierindustrie [Maschinenteile]
en: Screens used in the paper industry [parts of machines]

source: Staubsauger für industrielle Zwecke
en: Vacuum cleaners for industrial purposes

source: Kesselrohre [Maschinenteile]
en: Boiler tubes [parts of machines]

source: Staubsaugerzubehörteile zum Versprühen von Duftstoffen und Desinfektionsmitteln
en: Vacuum cleaner attachments for disseminating perfumes and disinfectants

source: Ährenheber [Maschinen]
en: Crop lifters [machines]

source: Getriebe, ausgenommen für Landfahrzeuge
en: Gear boxes, other than for land vehicles

source: Handgeführte Schermaschinen
en: Shearing machines (Hand-operated -)

source: Stoßdämpferfedern für Maschinen
en: Shock absorbing springs for machines

source: Schaufellader [Maschinen]
en: Shovel loaders [machines]

source: Servoschneider [Maschinen]
en: Servo-cutters [machines]

source: Servomotoren [ausgenommen für Landfahrzeuge]
en: Servomotors [other than for land vehicles]

source: Abfallzerkleinerer und -verdichter [elektrische Müllentsorgungseinheiten]
en: Waste masticators and compressors [electric waste disposal units]

source: Druckluftpumpen für die Flüssiggaszufuhr
en: Pneumatic pumps for the supply of liquefied gases

source: Rohre [angepasste Maschinenteile]
en: Pipes [fitted parts of machines]

source: Heftmaschinen [ausgenommen für Chirurgie- oder Schreibbedarf]
en: Stapling machines [other than for surgical or stationery use]

source: Ventilatorriemen für Motoren
en: Fan belts for motors and engines

source: Pneumatische Hämmer [Handgeräte]
en: Pneumatic hammers [hand-held]

source: Stromanlagen [Generatoren]
en: Power installations [generators]

source: Kraftstoffeinspritzer für Motoren von Land- und Wasserfahrzeugen
en: Fuel injector parts for land and water vehicle engines

source: Dampfkondensatoren [Maschinenteile]
en: Steam condensers [parts of machines]

source: Rotierenden Pressen [für Textilien]
en: Rotary presses [for textiles]

source: Zentrifugen [Maschinen]
en: Centrifugal machines

source: Etikettiermaschinen [ausgenommen für Bürozwecke]
en: Labelling machines [other than for office use]

source: Etikettenausgabemaschinen [ausgenommen für Bürozwecke]
en: Label dispensing machines [other than for office use]

source: Kaschiermaschinen, ausgenommen für Bürozwecke
en: Lamination coating machines other than for office use

source: Katalysatoren als Teile von Fahrzeugabgasanlagen
en: Catalytic converters being parts of vehicle exhausts

source: Viehbetäubungsapparate [Maschinen]
en: Cattle stunning appliances [machines]

source: Zementbohrer für Bohrmaschinen
en: Cement drills for drilling machines

source: Hebemaschinen für den Lastenumschlag
en: Lifting machines for handling loads

source: Fleischschneider [elektrische Maschinen]
en: Meat cutters [electric machines]

source: Mechanische Kraftübertragungsmechaniken [ausgenommen für Landfahrzeuge]
en: Mechanical power transmitting mechanisms [other than for land vehicles]

source: Mechanische Prägewerkzeuge [Maschinenteile]
en: Mechanical stamping tools [parts for machines]

source: Schleifscheiben [Werkzeuge für Maschinen]
en: Abrasive grinding wheels [tools for machines]

source: Hähne aus Metall [Ventile] [Maschinenteile]
en: Cocks [valves] of metal parts of machines

source: Maschinen zum Färben von Textilien
en: Machines for dyeing textiles

source: Schneidgeräte für maschinelle Handwerkzeuge
en: Cutting tools for use in powered hand-held tools

source: Zylinderdeckel [Maschinenteile]
en: Cylinder covers [parts of machines]

source: Dieselmotoren für Luftfahrzeuge
en: Diesel engines for air vehicles

source: Differentialgetriebe für Maschinen
en: Differential gear mechanisms for machines

source: Drehzentren [Maschinen]
en: Metal machining centres

source: Sicherheitsventile aus Metall [Maschinenteile]
en: Metal safety valves [parts of machines]

source: Fräswerkzeuge [Teile von Maschinen]
en: Milling tools [parts for machines]

source: Schleifscheiben für Schleifmaschinen
en: Turbine blades treated with alloys

source: Maschinen zum Waschen von Gemüse
en: Flap discs for power-operated grinders

source: Schleifmaschinen [zur Metallbearbeitung]
en: Granulating machines [for chemical processing]

source: Waschmaschinen mit Münzbetrieb
en: Moulds [parts of machines]

source: Hitzepumpen [Maschinenteile]
en: Coin-operated washing machines

source: Hydraulikpumpen
en: Hydraulic pumps

source: Förderbänder mit einer vollständig gekrümmten Achse
en: Belt conveyors having a totally curved axis

source: Sicherheitsventile [Maschinenteile]
en: Safety valves [parts of machines]

source: Rotierende Schneidanlagen [Maschinen]
en: Rotary cutting installations [machines]

source: Rotierende Bohrer [Maschinen]
en: Rotary drills [machines]

source: Maisschälmaschinen [traktorgezogene landwirtschaftliche Geräte]
en: Corn huskers [tractor towed agricultural implements]

source: Abgasleitungen [Maschinenteile]
en: Waste gas conduits [parts of machines]

source: Abgasrückschlagventile [Maschinenteile]
en: Waste gas return valves [parts of machines]

source: Elektrische Lichtbogenschweißmaschinen
en: Arc welding apparatus [electric machines]

source: Kupferrohre [Maschinenteile]
en: Copper tubes [parts of machines]

source: Schläuche [aus Metall] für Hydrauliksysteme in Maschinen
en: Hoses (Metal -) for use in hydraulic systems in machines

source: Elektrische Gewürzmühlen
en: Spice grinders (Electric -)

source: Stachelwalzen zur Bodenbelüftung [Maschinen]
en: Spiked rollers [machines] for use in soil aeration

source: Kolben für Landfahrzeugmotoren
en: Pistons for land vehicle engines

source: Saatgutdriller [Maschinenteile]
en: Seed drills [parts of machines]

source: Segmentsägeblätter für Maschinen
en: Segmental saw blades for machines

source: Selbstzentrierende Spannfutter [Maschinenteile]
en: Self-centring chucks [parts of machines]

source: Bohrmaschinen mit Eigenantrieb
en: Self-driven machines for drilling

source: Sägemaschinen mit Eigenantrieb
en: Self-driven machines for sawing

source: Gebläse zum Komprimieren, Ansaugen und für den Transport von Getreide
en: Blowing machines for the compression, sucking and carrying of grain

source: Lochstanzen [zur Metallbearbeitung]
en: Punching presses [for metalworking]

source: Zahnriemen für Fahrzeugmotoren
en: Belts (Timing -) for vehicle engines

source: Hydraulisch betätigte Schalter
en: Hydraulically operated switches

source: Schlagbohrer [Maschinen oder Maschinenteile]
en: Impact drills [machines or parts of machines]

source: Werkzeuge zur Wirkungsverstärkung bei der Ausführung von Erdölbohrungen
en: Impact enhancing tools for use in the completion of oil wells

source: Dampfgeneratoren [Maschinenteile]
en: Steam boilers [parts of machines]

source: Maschinen zur Herstellung von Mineralwässern
en: Machines for the production of mineral water

source: Vakuumregler [Teile von Motoren]
en: Vacuum control valves [parts of engines]

source: Ventilbaugruppen aus Metall [Maschinenteile]
en: Valve assemblies of metal [parts of machines]

source: Sauggebläse zum Verdichten von Körnern
en: Suction fans for the compression of grain

source: Saugventile für Luftkompressoren
en: Suction valves for air compressors

source: Ölwannen als Fahrzeuggetriebeteile [ausgenommen für Landfahrzeuge]
en: Sumps being parts of vehicle gearboxes [other than land vehicle]

source: Pressmaschinen für die Montagevorbereitung von Hydraulikschläuchen
en: Swaging machines for use in the preparation of hydraulic hoses

source: Formen für Spritzgusswerkzeuge
en: Moulds for injection moulding tools

source: Montierte Lager [Maschinenteile]
en: Mounted bearings [parts of machines]

source: Elektrische Antriebe für Wasserfahrzeuge
en: Electric propulsion mechanisms for water vehicles

source: Elektrische Nagelpistolen
en: Power-operated nailing guns

source: Messerhalter [Maschinenteile]
en: Blade holders [parts of machines]

source: Brennlanzen [Maschinen]
en: Thermic lances [machines]

source: Spitzsenker [Elektrowerkzeuge]
en: Countersinks [power tools]

source: Maschinen zur Hochdruckreinigung von Oberflächen mit Wasser
en: Machines for cleaning surfaces using high pressure water

source: Strahlpumpen zur Vakuumerzeugung
en: Jet pumps for vacuum generation

source: Elektrische Zündungen für Verbrennungsmotoren
en: Electric ignition apparatus for internal combustion engines

source: Sprühaufsätze [Maschinenteile]
en: Spray fittings [parts of machines]

source: Absperrventile aus Kunststoff [Maschinenteile]
en: Stop valves of plastic [parts of machines]

source: Zahnriemenscheiben [Motorenteile]
en: Timing belt pulleys [parts of engines]

source: Nadelpistolen [Maschinen]
en: Needle pistols [machines]

source: Rückstauklappen aus Metall [Maschinenteile]
en: Non-return flaps of metal [parts of machines]

source: Trenngeräte für Gewebebahnen [Maschinen]
en: Web separation devices [machines]

source: Maschinen zur Vorbehandlung von Partikeloberflächen
en: Attrition machines for particle surface preparation

source: Automatische Bogenklebemaschinen
en: Auto sheet laminating machines

source: Pumpen für die Entnahme von Gas [Maschinen]
en: Pumps for the extraction of gases [machines]

source: Stanzpressen zum Nachstanzen von Teilen
en: Punching presses for the final punching of parts

source: Stanzwerkzeuge [elektrisch], ausgenommen für Bürozwecke
en: Punching tools [electric], other than for office use

source: Maschinen für den Erdaushub
en: Machines for excavating earth

source: Antriebsmaschinen, ausgenommen für Landfahrzeuge
en: Driving motors, other than for land vehicles

source: Antriebsscheiben für Kraftübertragungsriemen von Industriemaschinen
en: Drive pulleys for power transmission belts of industrial machines

source: Granulierplatten als Maschinenteile
en: Pelletizer plates being parts of machines

source: Schlaghämmer [Maschinen]
en: Percussion hammers [machines]

source: Raketentriebwerke für Waffen
en: Rocket propulsion engines for weapons

source: Modulare Kupplungen für Werkzeugmaschinen
en: Flexible jacks (Power operated -)

source: Kehrmaschinen für Schwimmbecken
en: Modular couplings for machine tools

source: Mechanische Steuerungen für Motoren und Maschinen
en: Sweeping machines for use in swimming pools

source: Gartenwalzen [Maschinen]
en: Garden rollers [machines]

source: Verpackungswerkzeuge [Maschinen]
en: Packaging tools [machines]

source: Bürsten für Staubsauger
en: Brushes for vacuum cleaners

source: Sortierschlitten [Teile von industriellen Sortiermaschinen]
en: Sorting slides [parts of industrial sorting machines]

source: Gerbmaschinen für Leder
en: Leather tanning machines

source: Maschinen zur Herstellung von Halbleitersubstraten
en: Semiconductor substrates manufacturing machines

source: Elektrische Staubsauger und deren Bauteile
en: Electric vacuum cleaners and their components

source: Elektrische Schweißgeräte für Kunststoffverpackungen
en: Electrical apparatus for sealing plastics [packaging]

source: Luftfedern für Maschinen
en: Airsprings for machines

source: Sprühbalken zum Anhängen an Fahrzeuge zum Besprühen von Feldfrüchten
en: Spraying booms for towing behind vehicles for spraying crops

source: Prägemaschinen zum Pressen [Formen] von Teilen aus Bögen
en: Stamping machines for pressing [shaping] components from sheet materials

source: Stanzmaschinen für Druckereierzeugnisse in Bogenform
en: Stamping machines for printed materials in sheet form

source: Steppmaschinen für die Herstellung von Matratzen
en: Quilting machines for use in the manufacture of mattresses

source: Druckluftturbinen [ausgenommen für Landfahrzeuge]
en: Ram air turbines [other than for land vehicles]

source: Werkstückträger [Maschinen]
en: Workpiece carriers [machines]

source: Werkstückträger [Maschinenteile]
en: Workpiece carriers [parts of machines]

source: Zerkleinerungsanlagen für industrielle Zwecke
en: Crushing machines for industrial purposes

source: Elektrisch betriebene Handspritzmaschinen
en: Hand held power operated spraying machines

source: Nassschleifscheiben [Maschinen]
en: Wet wheel abrasive cutters [machines]

source: Elektrisch betriebene Aufzüge zum Bewegen, Parken und Abstellen von Landfahrzeugen
en: Power-operated lifts for moving, parking and storing land vehicles

source: Elektrisch betriebene Schmiermittelspender für Maschinen
en: Power-operated lubricant dispensers for machines

source: Kraftbetriebene Knarrenschrauber
en: Power-operated ratchet wrenches

source: Kraftbetriebene Nietmaschinen
en: Power-operated rivet guns

source: Druckluftspritzpistolen für Spachtelmassen
en: Compressed air guns for the extrusion of mastics

source: Generatoren
en: Generators

source: Antriebsketten für Luftfahrzeuge
en: Drive chains for driving aircraft

source: Maschinen zum Schleifen
en: Machines for scouring

source: Maschinen zum Waschen von Laborgeräten
en: Machines for washing laboratory apparatus

source: Magnetbremsen für Maschinen
en: Magnetic brakes for machines

source: Magnetische Klammern [Maschinenteile]
en: Magnetic clamps [parts of machines]

source: Gekühlte Verkaufsautomaten
en: Refrigerated vending machines

source: Numerisch gesteuerte Modelliermaschinen für den Hausgebrauch
en: Numerically controlled modelling machines for home use

source: Baumsägen [motorisiert]
en: Pruning saws [motorised]

source: Dampfhämmer [Maschinen]
en: Steam hammers [machines]

source: Lenkgestänge für Maschinen
en: Steering linkages for machines

source: Spindeln für Werkzeugmaschinen
en: Spindles for machine tools

source: Spinnräder [Maschinen]
en: Spinning wheels [machines]

source: Maschinen zum Bedrucken von textilen Materialien
en: Machines for printing textile materials

source: Schaufel für hydraulische Hubmaschinen
en: Buckets for use with hydraulic lifting machines

source: Maschinenhalter in Form von Ständern [an die Maschine angepasst]
en: Machine holders being stands [being adapted for the machine]

source: Mähschaufeln [Maschinen oder Maschinenteile]
en: Mowing buckets [machines or parts of machines]

source: Werkzeugmaschinen zum Binden von Schläuchen
en: Tools (Machine -) for use in binding hoses

source: Spritzgussformen
en: Injection moulds

source: Anlagen für den Schüttgutumschlag von pulverförmigem Material
en: Installations for the bulk handling of pulverulent materials

source: Schwerkraftförderer [Maschinen]
en: Gravity conveyors [machines]

source: Schleifmaschinen zum Aufbereiten der Kanten von Werkzeugen
en: Grinding machines for refacing the edges of tools

source: Elektrische Entsaftungsmaschinen für Orangen
en: Orange juice extracting machines [electric]

source: Industrielle Schneidemaschinen
en: Industrial cutting machines

source: Ackerfräsen [Maschinen]
en: Motor hoes [machines]

source: Zerstäuber [Maschinen] für Insektizide
en: Atomizers [machines] for insecticides

source: Sprühlanzen als gartenbauliche Geräte
en: Spray lances being horticultural implements

source: Sprühwalzen als gartenwirtschaftliche Werkzeuge
en: Spray rollers being horticultural implements

source: Ackermaschinen für landwirtschaftliche Zwecke
en: Tilling implements for agricultural use

source: Mobile Hebebühnen [elektrisch]
en: Mobile aerial work platforms [electric]

source: Mobile Hebebühnen [hydraulisch]
en: Mobile aerial work platforms [hydraulic]

source: Ahlen [Elektrowerkzeuge]
en: Awls [powered tools]

source: Sackverdichter [Maschinen]
en: Bag compactors [machines]

source: Gaserzeuger [Kompressoren] zum Aufblasen von unbeweglichen Bauten
en: Gas generators [compressors] for inflating rigid structures

source: Granulierstempel als Maschinenteile
en: Pelletizer dies being parts of machines

source: Schalldichte Hauben [Maschinenteile]
en: Soundproof hoods [parts of machines]

source: Hackmaschinen [elektrisch] für gewerbliche Zwecke
en: Mincing machines [electric] for industrial use

source: Metalldichtungen für Rohre [Teile von Motoren]
en: Joints for tubes (metal -) [parts of engines]

source: Hubplattformen zur Montage an Fahrzeugen
en: Elevating platforms for attachment to vehicles
